import React, { useEffect } from 'react'
import about from '../assets/images/About/about.jpg'
import aboutC from '../assets/images/About/about-cover.avif'
import aboutC2 from '../assets/images/About/about-cover.jpg'
import aboutC3 from '../assets/images/About/AB_MakingSenseOfESGBondStructures-1600x760.w.jpg'
import logo from '../assets/images/HomePage/0.png'
export function AboutPage() {

    useEffect(() => {
        document.title = 'KingSize | קצת עלינו';
    }, [])

    return (
        <section className='about full'>
            {/* <div className="img-container full">
                <img src={aboutC3} alt="" />
            </div> */}
            <div className="content">
                <div className='logo'>
                    <img src={logo} alt="" />
                </div>
                <div className="main-content">
                    <img src={about} alt="" />
                    <div className="text">
                        <p>היי,</p>
                        <p>
                            שמחים שקפצתם לבקר ולהכיר את הסיפור שלנו - סיפור של בדים, צבעים וסגנון, סיפור של אהבה לבית, לנוחות ולפינוק.
                            הסיפור שלנו מתחיל אי-שם בתחילת שנות העשרים, כאשר אליעזר ורשבסקי עלה לארץ והקים מפעל טקסטיל לניקיון הבית. כאשר ראה שהרבה ישראלים הולכים לים, הוא התאים את ייעודו והפך אותו למפעל מגבות שזכה לשם ורדינון, שפירושו בושם ורדים.

                            <p> עם השנים הרחיבה החברה את פעילותה לייצור ושיווק מצעים וכלי מיטה, וכבר כמה עשורים שאנחנו בורדינון מלווים אתכם ביום ובלילה, בכל עונות השנה. יש לנו בשבילכם מבחר עצום של מצעים רכים, מגבות מלטפות, שמיכות מפנקות. מלבדם, אנחנו משתדלים לרגש ולהלהיב אתכם במוצרים לתינוקות, לילדים ולבני נוער, ולרפד לכם את הבית עם כריות צבעוניות, שטיחוני אמבטיה, סבונים ריחניים, מעמדי נרות ועוד שלל אביזרי נוי ועיצוב.
                                להנאתכם ולנוחיותכם אנחנו מפעילים מעל 70 חנויות בפריסה ארצית ומזמינים אתכם לחוויית קנייה נעימה ובטוחה באתר המעודכן שלנו, בו תוכלו לצפות ולבחור בנוחות מכל שפע עולמות המוצרים שלנו.
                            </p>
                        </p>
                        <br />
                        <p>
                            כל המוצרים שלנו עשויים מחומרים איכותיים בטכנולוגיות מתקדמות. אנחנו מקפידים על עיצובים עדכניים וטרנדיים, המחוברים למגמות השולטות בעולמות עיצוב ואבזור הבית.
                            כנהוג בעולם, הקולקציות שלנו משלימות זו את זו, ואתם יכולים לסגנן באמצעותן אווירה נעימה, שלווה וביתית בכל חדרי הבית.
                            אנחנו ממליצים שתתחילו את הסיבוב שלכם בבדיקת מוצרי חדר השינה, תעברו לפינוקים לאמבטיה ואל תשכחו להציץ גם בממלכת הילדים. גם להם מגיע.
                            אנחנו מזמינים אתכם לחזור אלינו שוב ושוב כדי שתוכלו להתעדכן בקולקציות החדשות שלנו.
                        </p>
                        <p>
                            אז בואו נעשה עסק: אנחנו נמשיך לרגש ולחדש לכם, ואתם תמשיכו לשמור על קשר. הולך?
                        </p>
                    </div>
                </div>
            </div>
        </section >
    )
}
